{
    "version": "https://jsonfeed.org/version/1",
    "title": "Christina Poguter",
    "description": "",
    "home_page_url": "https://christinapoguter.netlify.app",
    "feed_url": "https://christinapoguter.netlify.app/feed.json",
    "user_comment": "",
    "author": {
        "name": "Christina Poguter"
    },
    "items": [
        {
            "id": "https://christinapoguter.netlify.app/diplomarbeit.html",
            "url": "https://christinapoguter.netlify.app/diplomarbeit.html",
            "title": "Diplomarbeit",
            "summary": "Projekt: Modernisierung der Repo Print Website Im Rahmen unserer Diplomarbeit haben wir die veraltete Website der Firma Repo Print komplett überarbeitet und modernisiert. Das Ziel war es, eine professionelle und funktionale Online-Präsenz zu schaffen, die den Fortschritt und die vielfältigen Angebote des Unternehmens widerspiegelt. Neben&hellip;",
            "content_html": "<p><strong>Projekt: Modernisierung der Repo Print Website</strong></p>\n<p><br>Im Rahmen unserer Diplomarbeit haben wir die veraltete Website der Firma <strong>Repo Print</strong> komplett überarbeitet und modernisiert. Das Ziel war es, eine professionelle und funktionale Online-Präsenz zu schaffen, die den Fortschritt und die vielfältigen Angebote des Unternehmens widerspiegelt. Neben der Darstellung neuer Druckverfahren wie <strong>DTF-Druck</strong> und <strong>Textildruck</strong> wurde die Website um eine <strong>Shop-Funktion</strong> erweitert, die Kunden ermöglicht, Produkte wie Sticker und Folien direkt online zu bestellen.</p>\n<hr>\n<p><strong>Die Idee hinter dem Projekt:</strong><br>Repo Print ist ein Familienunternehmen, das seit 2010 auf dem Markt ist und sich auf Druckverfahren wie <strong>Tampondruck</strong> spezialisiert hat. Mit der Einführung neuer Technologien, darunter <strong>DTF-Druck</strong> und zukünftiger <strong>Stickerdruck</strong>, wurde es notwendig, eine Website zu schaffen, die diese Innovationen zeigt und das Unternehmen modern präsentiert.</p>\n<hr>\n<p><strong>Wichtige Funktionen:</strong></p>\n<ul>\n<li><strong>Shop-Funktion:</strong> Kunden können Sticker und Folien direkt online bestellen.</li>\n<li><strong>Interaktives Design-Tool:</strong> Ermöglicht es, Logos oder Designs virtuell auf Textilien zu platzieren.</li>\n<li><strong>Aktuelle Unternehmensinformationen:</strong> Darstellung aller Druckverfahren, Standorte und künftiger Angebote.</li>\n<li><strong>Modernes Design:</strong> Professionell gestaltete und leicht zu navigierende Oberfläche, die die Werte von Repo Print widerspiegelt.</li>\n</ul>\n<hr>\n<p><strong>Technologien und Methodik:</strong></p>\n<ul>\n<li><strong>Webentwicklung:</strong> Modernste Technologien und Frameworks für eine benutzerfreundliche und skalierbare Lösung.</li>\n<li><strong>SCRUM-Methodik:</strong> Agile Entwicklung mit klarer Aufgabenverteilung und regelmäßigen Sprints.</li>\n<li><strong>Quellcode-Verwaltung:</strong> Nutzung von <strong>GitHub</strong> für Versionskontrolle und Zusammenarbeit im Team.<hr></li>\n</ul>\n<p><strong>Aktueller Stand:</strong><br>Das Projekt befindet sich derzeit noch in der Entwicklungsphase. Erste Entwürfe und Konzepte wurden erstellt, und die grundlegende Struktur der neuen Website ist definiert. Der Fokus liegt aktuell auf der Implementierung der interaktiven Funktionen und des Online-Shops.</p>\n<hr>\n<p><strong>Ausblick:</strong><br>Mit der neuen Website soll Repo Print eine moderne, zukunftsfähige Plattform erhalten, die sowohl bestehende Kunden als auch neue Zielgruppen anspricht. Die interaktiven Features und der Online-Shop werden das Kundenerlebnis erheblich verbessern und das Unternehmen in der digitalen Welt optimal positionieren.</p>",
            "author": {
                "name": "Christina Poguter"
            },
            "tags": [
                   "Gruppenarbeit"
            ],
            "date_published": "2024-12-05T17:21:09+01:00",
            "date_modified": "2024-12-05T17:28:57+01:00"
        },
        {
            "id": "https://christinapoguter.netlify.app/nimpola.html",
            "url": "https://christinapoguter.netlify.app/nimpola.html",
            "title": "Nimpola",
            "summary": "Nimpola - Ein Story-Survival-Spiel im Polygon-Stil Im Rahmen einer Gruppenarbeit haben wir ein spannendes Spiel entwickelt: Nimpola. Dieses Projekt vereinte Kreativität, technische Herausforderungen und Teamarbeit. Unser Ziel war es, ein immersives Spielerlebnis zu schaffen, das sowohl mit Gameplay als auch mit technischen Features überzeugt Die&hellip;",
            "content_html": "<p data-pm-slice=\"1 1 []\"><strong>Nimpola - Ein Story-Survival-Spiel im Polygon-Stil</strong></p>\n<p>Im Rahmen einer Gruppenarbeit haben wir ein spannendes Spiel entwickelt: <strong>Nimpola</strong>. Dieses Projekt vereinte Kreativität, technische Herausforderungen und Teamarbeit. Unser Ziel war es, ein immersives Spielerlebnis zu schaffen, das sowohl mit Gameplay als auch mit technischen Features überzeugt</p>\n<hr>\n<h3 data-pm-slice=\"1 1 []\"><strong>Die Idee hinter Nimpola</strong></h3>\n<p>Die Story von Nimpola dreht sich um eine mysteriöse Insel, die Wissenschaftlern Rätsel aufgibt. Wegen unerklärlicher Signalstörungen konnte die Insel nicht mehr überwacht werden. Ein Wissenschaftler wurde entsandt, um die Ursache zu untersuchen, doch auch er verschwand spurlos. Als Spieler wird man auf diese Insel geschickt, um das Geheimnis zu lüften, den Wissenschaftler zu finden und die Quelle der Signalstörungen zu entdecken.</p>\n<hr>\n<h3 data-pm-slice=\"1 1 []\"><strong>Wichtige Funktionen</strong></h3>\n<ul data-spread=\"false\" data-pm-slice=\"3 3 []\">\n<li>\n<p><strong>Die Insel</strong> ist in verschiedene Sektoren unterteilt, die mit zunehmender Schwierigkeit unterschiedliche Herausforderungen bieten.</p>\n</li>\n<li>\n<p><strong>Das Dorf:</strong> Ein wichtiger Bestandteil des Spiels ist das Vertrauen der Dorfbewohner, das durch das Erledigen von Aufgaben gewonnen wird. Ohne ihre Hilfe ist ein Weiterkommen kaum möglich.</p>\n</li>\n<li>\n<p><strong>Gefahren:</strong> Die Insel ist von Monstern bevölkert, die durch die Sektoren patrouillieren und den Spieler herausfordern.</p>\n</li>\n<li>\n<p><strong>Der Spieler:</strong> Neben grundlegenden Fähigkeiten steht dem Spieler ein animiertes Schwert zur Verfügung, das nicht nur zur Verteidigung dient, sondern auch taktische Elemente im Kampf bietet.</p>\n<hr></li>\n</ul>\n<h3 data-pm-slice=\"1 1 []\"><strong>Technische Highlights</strong></h3>\n<ul data-spread=\"false\" data-pm-slice=\"3 3 []\">\n<li>\n<p><strong>Blender</strong>: Hier haben wir die Map der Insel modelliert und optimiert. Der Polygon-Stil verleiht dem Spiel seinen einzigartigen Look.</p>\n</li>\n<li>\n<p><strong>Unity</strong>: Mit Unity haben wir die Spielwelt aufgebaut, Events und Mechaniken integriert.</p>\n</li>\n<li>\n<p><strong>C#</strong>: Die Programmierung des Spiels wurde mit C# umgesetzt.</p>\n</li>\n<li>\n<p><strong>Künstliche Intelligenz:</strong> Wir haben eine KI für die Gegner entwickelt, die adaptives Verhalten zeigt. Sie reagiert auf den Spieler, verfolgt ihn und agiert je nach Umgebung taktisch.</p>\n</li>\n<li>\n<p><strong>Animationen:</strong> Besonders stolz sind wir auf das animierte Schwert, das nicht nur visuell ansprechend ist, sondern auch durch dynamische Bewegungen für ein realistisches Spielerlebnis sorgt.</p>\n</li>\n<li>\n<p><strong>Level-Design:</strong> Die verschiedenen Sektoren der Insel wurden so gestaltet, dass sie das Fortschreiten im Spiel spannend und herausfordernd machen.</p>\n<hr></li>\n</ul>\n<h3 data-pm-slice=\"1 1 []\"><strong>Lessons Learned</strong></h3>\n<p data-pm-slice=\"1 1 []\">Dieses Projekt hat uns nicht nur technisches Wissen vermittelt, sondern uns auch gezeigt, wie wichtig gute <strong>Planung</strong> und <strong>Teamarbeit</strong> sind:</p>\n<ul data-spread=\"false\" data-pm-slice=\"3 3 []\">\n<li>\n<p><strong>Zeitplanung</strong>: Wir haben gelernt, wie man Aufgaben priorisiert und Deadlines setzt.</p>\n</li>\n<li>\n<p><strong>Kreativität trifft Realismus</strong>: Die Balance zwischen einer ambitionierten Vision und der praktischen Umsetzung war eine zentrale Lektion.</p>\n</li>\n<li>\n<p><strong>Teamdynamik</strong>: Kommunikation und das klare Verteilen von Verantwortlichkeiten haben uns geholfen, das Projekt erfolgreich abzuschließen.</p>\n<hr></li>\n</ul>\n<h3 data-pm-slice=\"1 1 []\"><strong>Technologien und Methodik</strong></h3>\n<ul data-spread=\"false\" data-pm-slice=\"3 3 []\">\n<li>\n<p><strong>Tools</strong>: Blender für die Map, Unity für die Spielmechaniken und C# für den Code.</p>\n</li>\n<li>\n<p><strong>Entwicklungsmethodik</strong>: Wir haben SCRUM verwendet, mit regelmäßigen Sprints und einer klaren Aufgabenverteilung.</p>\n</li>\n<li>\n<p><strong>Quellcode-Verwaltung</strong>: GitHub war unser zentraler Ort für Versionskontrolle und Dokumentation.</p>\n<hr></li>\n</ul>\n<h3 data-pm-slice=\"1 1 []\"><strong>Fazit</strong></h3>\n<p data-pm-slice=\"1 1 []\">Das Projekt war eine spannende Herausforderung, bei der wir die Welt von Nimpola zum Leben erweckt haben. Durch die Verwendung von Blender, Unity und C# sowie die Implementierung von Features wie adaptiver KI und Animationen konnten wir ein fesselndes Spiel schaffen. Nimpola zeigt, wie Kreativität und technische Umsetzung Hand in Hand gehen können, und ist ein Highlight in unserem Portfolio.</p>\n<p> </p>",
            "author": {
                "name": "Christina Poguter"
            },
            "tags": [
                   "Gruppenarbeit"
            ],
            "date_published": "2024-11-29T09:11:17+01:00",
            "date_modified": "2024-11-29T09:17:42+01:00"
        },
        {
            "id": "https://christinapoguter.netlify.app/mbot-projekt.html",
            "url": "https://christinapoguter.netlify.app/mbot-projekt.html",
            "title": "MBOT-Projekt",
            "summary": "MBot2 – Fernsteuerung und Automatisierung GitHub-Repository-Group-MBot2 Im Rahmen einer Gruppenarbeit haben wir eine Anwendung entwickelt, um den MBot2 von mBlock aus der Ferne zu steuern. Der Roboter verfügt über eine Vielzahl von Sensoren (z.B. Ultraschall-, Lichtsensor, Lagesensor) und kann über MicroPython programmiert werden. Unsere Anwendung&hellip;",
            "content_html": "<h3><strong>MBot2 – Fernsteuerung und Automatisierung</strong></h3>\n<p><a href=\"https://github.com/orgs/Gruppe5HTL/repositories\">GitHub-Repository-Group-MBot2</a></p>\n<p>Im Rahmen einer Gruppenarbeit haben wir eine Anwendung entwickelt, um den <strong>MBot2</strong> von mBlock aus der Ferne zu steuern. Der Roboter verfügt über eine Vielzahl von Sensoren (z.B. Ultraschall-, Lichtsensor, Lagesensor) und kann über <strong>MicroPython</strong> programmiert werden. Unsere Anwendung ermöglicht es, den Roboter sowohl von einem <strong>PC</strong> als auch von einem <strong>mobilen Endgerät</strong> zu steuern. Die Steuerung erfolgt über ein WLAN-Netzwerk, wobei der Roboter sich automatisch mit dem Netzwerk verbindet und eine Verbindung zur Anwendung aufbaut.</p>\n<hr>\n<h5><strong>Wichtige Funktionen:</strong></h5>\n<ul>\n<li>Steuerung des MBots über <strong>PC</strong> und <strong>Handy</strong></li>\n<li>Anzeige und regelmäßige Aktualisierung der Werte sämtlicher <strong>Sensoren und Aktoren</strong></li>\n<li>Einstellbare <strong>Fahrgeschwindigkeit</strong> und Steuerbefehle wie vorwärts, rückwärts, links, rechts</li>\n<li><strong>Suicide-Prevention</strong>-Feature zur Vermeidung von Kollisionen</li>\n<li>Anzeige der <strong>IP-Adresse</strong> nach erfolgreicher WLAN-Verbindung</li>\n<li><strong>Linienfolgemodus</strong>, bei dem der Roboter automatisch einer Linie folgt</li>\n<li>Steuerung und Anpassung der <strong>LED-Farben</strong> des Robots über die Anwendung</li>\n</ul>\n<hr>\n<h5><strong>Technische Details:</strong></h5>\n<ul>\n<li>Der Roboter nutzt <strong>MicroPython</strong> für die Programmierung, das über die <strong>cyberpi</strong>-Controllereinheit mit dem Roboter verbunden ist.</li>\n<li>Die Kommunikation erfolgt über <strong>WLAN</strong>, wobei die Verbindung durch visuelle <strong>LED-Statusanzeigen</strong> des Controllers angezeigt wird (blau für Verbindungsaufbau, grün für erfolgreiche Verbindung, rot für Fehler).</li>\n<li>Das System wurde nach den <strong>agilen Methoden (SCRUM)</strong> entwickelt, mit regelmäßigem Einsatz von <strong>Sprints</strong> und <strong>GitHub</strong> für die Quellcode- und Dokumentationsverwaltung.</li>\n</ul>\n<hr>\n<h5><strong>Technologien:</strong></h5>\n<ul>\n<li><strong>MicroPython</strong> für die Programmierung des MBot2</li>\n<li><strong>WLAN-Kommunikation</strong> zur Verbindung zwischen Roboter und Anwendung</li>\n<li><strong>SCRUM</strong> für das agile Projektmanagement</li>\n<li><strong>GitHub</strong> für Versionskontrolle und Dokumentation</li>\n</ul>\n<hr>\n<h5><strong>Ziel des Projekts:</strong></h5>\n<p><br>Das Ziel dieses Projekts war es, einen flexiblen, benutzerfreundlichen Steuerungsmechanismus für den MBot2 zu entwickeln, der sowohl auf <strong>PCs</strong> als auch auf <strong>mobilen Geräten</strong> funktioniert und verschiedene Funktionen wie automatische Steuerung und Sicherheitsfeatures bietet.</p>\n<hr>\n<h5><strong>Fazit:</strong></h5>\n<p><br>Das Projekt war eine spannende Herausforderung, bei der wir die Anwendung zur Steuerung des <strong>MBot2</strong> erfolgreich entwickelt haben. Durch die Verwendung von <strong>MicroPython</strong> und die Implementierung von Funktionen wie der <strong>Suicide Prevention</strong> und dem <strong>Linienfolgemodus</strong> konnten wir sicherstellen, dass der Roboter sowohl sicher als auch effizient arbeitet. Die Verbindung zwischen dem Roboter und der Anwendung über <strong>WLAN</strong> funktionierte reibungslos, und die Steuerung von <strong>PC</strong> und <strong>Handy</strong> stellte sicher, dass der Roboter in verschiedenen Szenarien genutzt werden konnte. Das Projekt hat uns nicht nur in der Programmierung weitergebracht, sondern auch wertvolle Erfahrungen im <strong>agilen Projektmanagement</strong> und in der <strong>Teamarbeit</strong> vermittelt.</p>",
            "author": {
                "name": "Christina Poguter"
            },
            "tags": [
                   "Gruppenarbeit"
            ],
            "date_published": "2024-11-22T12:07:18+01:00",
            "date_modified": "2024-11-29T09:02:08+01:00"
        },
        {
            "id": "https://christinapoguter.netlify.app/wettbuero.html",
            "url": "https://christinapoguter.netlify.app/wettbuero.html",
            "title": "Wettbuero",
            "summary": "Race Royal Bets – Das ultimative Wettbüro-Erlebnis GitHub-Repository-Wettbuero Race Royal Bets ist eine Plattform, auf der Nutzer auf verschiedene automatisierte Rennen wetten können. Die Renntypen umfassen Pferderennen, Schneckenrennen und Hunderennen. Die Rennen werden automatisch erstellt, sodass sich die Spieler ganz auf das Setzen ihrer Wetten&hellip;",
            "content_html": "<h3><strong>Race Royal Bets – Das ultimative Wettbüro-Erlebnis</strong></h3>\n<p><a href=\"https://github.com/Chris-tll/Semester_Projekt_Wettbuero\">GitHub-Repository-Wettbuero</a></p>\n<p><br><strong>Race Royal Bets</strong> ist eine Plattform, auf der Nutzer auf verschiedene <strong>automatisierte Rennen</strong> wetten können. Die Renntypen umfassen <strong>Pferderennen</strong>, <strong>Schneckenrennen</strong> und <strong>Hunderennen</strong>. Die Rennen werden automatisch erstellt, sodass sich die Spieler ganz auf das Setzen ihrer Wetten und das Verfolgen der Rennen konzentrieren können. Das Projekt umfasst eine <strong>WPF-Anwendung</strong>, eine begleitende <strong>Website</strong> und eine <strong>Datenbank</strong>, die alle relevanten Daten für die Rennen und Wetten speichert.</p>\n<hr>\n<h5><strong>Projektinhalte und Aufgaben:</strong></h5>\n<ul>\n<li><strong>Technologien:</strong>\n<ul>\n<li><strong>WPF (Windows Presentation Foundation):</strong> Zum Entwickeln der Desktop-Anwendung für das Wettbüro.</li>\n<li><strong>Datenbank:</strong> Speicherung von Renninformationen, Teilnehmern, Wett-Ergebnissen und Spielergebnissen.</li>\n<li><strong>Website:</strong> Bereitstellung von allgemeinen Informationen und Updates zu bevorstehenden Rennen.</li>\n</ul>\n</li>\n</ul>\n<hr>\n<h5><strong>Funktionen der WPF-Anwendung:</strong></h5>\n<ul>\n<li><strong>Automatisierte Rennen:</strong> Die Rennen (Pferderennen, Schneckenrennen und Hunderennen) werden automatisch generiert, einschließlich der Teilnehmer und deren Wahrscheinlichkeiten.</li>\n<li><strong>Wettabgabe:</strong> Benutzer können auf die verschiedenen Teilnehmer (Pferde, Schnecken oder Hunde) setzen und ihre Wetten platzieren.</li>\n<li><strong>Rennübersicht:</strong> Anzeige der bevorstehenden Rennen sowie eine detaillierte Übersicht über die Teilnehmer und die Wahrscheinlichkeiten jedes Rennens.</li>\n<li><strong>Ergebnisse und Statistiken:</strong> Nach Abschluss jedes Rennens werden die Ergebnisse sofort angezeigt. Eine Rangliste hilft den Nutzern, ihre Wettstrategien zu verbessern.</li>\n</ul>\n<hr>\n<h4><strong>Funktionen der Website:</strong></h4>\n<ul>\n<li><strong>Erklärung des Spiels:</strong> Die Website bietet eine klare Erklärung des Spiels und der Wettmöglichkeiten, damit neue Benutzer verstehen, wie das System funktioniert.</li>\n<li><strong>Zukünftige Rennen:</strong> Eine Liste aller bevorstehenden Rennen wird angezeigt, damit Spieler im Voraus planen können, auf welche Rennen sie wetten möchten.</li>\n<li><strong>Statistiken und Teilnehmer:</strong> Auf der Website gibt es eine Übersicht über die <strong>Teilnehmer</strong> der Rennen und deren vergangene Leistungen, um den Spielern bei ihren Wettentscheidungen zu helfen.</li>\n</ul>\n<hr>\n<h4><strong>Technologien und Tools:</strong></h4>\n<ul>\n<li><strong>WPF (Windows Presentation Foundation):</strong> Für die Desktop-Anwendung</li>\n<li><strong>Datenbank</strong>: Speicherung der Renn- und Wettinformationen (z.B. MySQL, PostgreSQL)</li>\n<li><strong>HTML, CSS, JavaScript</strong>: Für die Website und deren Benutzeroberfläche</li>\n<li><strong>SQL-Datenbank:</strong> Zur Verwaltung der Daten und Ergebnisse</li>\n<li><strong>Visual Studio:</strong> Für die Entwicklung der Anwendung und die Datenbankintegration</li>\n</ul>\n<hr>\n<h5><strong>Ziel des Projekts:</strong></h5>\n<p>Das Ziel von <strong>Race Royal Bets</strong> war es, eine benutzerfreundliche und dynamische Wettplattform zu entwickeln, die es Spielern ermöglicht, auf unterschiedliche und interessante Rennarten zu wetten. Durch die Automatisierung der Rennsimulationen und eine intuitive Benutzeroberfläche wurde eine spannende Wettumgebung geschaffen. Das Projekt kombiniert <strong>Spieleentwicklung</strong>, <strong>Datenbankdesign</strong> und <strong>Benutzeroberflächen-Design</strong> zu einer kompletten Lösung für Wettliebhaber.</p>\n<hr>\n<h4><strong>Fazit:</strong></h4>\n<p><strong>Race Royal Bets</strong> war ein herausforderndes, aber äußerst spannendes Projekt, bei dem ich viel über <strong>automatisierte Systeme</strong>, <strong>Wettmanagement</strong> und <strong>Datenbankdesign</strong> gelernt habe. Es hat mir gezeigt, wie man ein komplexes System entwickelt, das verschiedene Komponenten (wie eine Desktop-App, eine Website und eine Datenbank) miteinander kombiniert. Die positive Rückmeldung und die Erfahrung, ein so umfangreiches Projekt zu realisieren, waren sehr wertvoll für meine weitere Entwicklung als Entwickler.</p>",
            "author": {
                "name": "Christina Poguter"
            },
            "tags": [
                   "Einzelarbeit"
            ],
            "date_published": "2024-11-22T10:38:48+01:00",
            "date_modified": "2024-11-29T09:02:13+01:00"
        },
        {
            "id": "https://christinapoguter.netlify.app/adventskalender.html",
            "url": "https://christinapoguter.netlify.app/adventskalender.html",
            "title": "Adventskalender",
            "summary": "<p>Für dieses Projekt haben wir einen <strong>interaktiven Adventskalender</strong> in <strong>Java</strong> entwickelt, der es Nutzern ermöglicht, jeden Tag im Dezember ein neues \"Türchen\" zu öffnen und eine kleine Überraschung zu entdecken. Es war ein Schulprojekt, das wir über mehrere Monate hinweg im Rahmen unserer Ausbildung bearbeitet haben. Ziel war es, nicht nur ein funktionales Programm zu erstellen, sondern auch kreative Ideen umzusetzen und die Prinzipien der objektorientierten Programmierung zu vertiefen.</p>\n",
            "content_html": "<p>Für dieses Projekt haben wir einen <strong>interaktiven Adventskalender</strong> in <strong>Java</strong> entwickelt, der es Nutzern ermöglicht, jeden Tag im Dezember ein neues \"Türchen\" zu öffnen und eine kleine Überraschung zu entdecken. Es war ein Schulprojekt, das wir über mehrere Monate hinweg im Rahmen unserer Ausbildung bearbeitet haben. Ziel war es, nicht nur ein funktionales Programm zu erstellen, sondern auch kreative Ideen umzusetzen und die Prinzipien der objektorientierten Programmierung zu vertiefen.</p>\n<hr>\n<h4><strong>Projektinhalte und Herausforderungen:</strong></h4>\n<ul>\n<li><strong>Programmiersprache:</strong> Java (mit IntelliJ IDEA als IDE)</li>\n<li><strong>Technologien:</strong> JavaFX für die Benutzeroberfläche, grundlegende Datenstrukturen zur Verwaltung der Türchen und Benutzerinteraktionen.</li>\n<li><strong>Besondere Features:</strong>\n<ul>\n<li>Jeder Tag öffnet ein neues Fenster mit einem <strong>Rätsel</strong> oder einer <strong>Überraschung</strong> (z. B. kleine Scherzfragen, Witze oder Weihnachtsfakten).</li>\n<li>Ein <strong>Wettbewerb</strong> zwischen den Schülern wurde veranstaltet, bei dem die drei beste Projekte einen Preis erhalten haben.</li>\n<li>Besonders interessant war es, den Kalender <strong>skalierbar</strong> zu gestalten, sodass er auch nachträglich leicht angepasst werden kann (z. B. für andere Jahre oder mit zusätzlichen Funktionen).</li>\n</ul>\n</li>\n</ul>\n<hr>\n<h4><strong>Projekterfahrung:</strong></h4>\n<p>Das Projekt hat mir nicht nur geholfen, meine Kenntnisse in <strong>Java</strong> und <strong>JavaFX</strong> zu vertiefen, sondern auch meine Fähigkeiten im <strong>Teamwork</strong> und <strong>Projektmanagement</strong> weiter auszubauen. Die Herausforderung bestand darin, ein funktionales, benutzerfreundliches und gleichzeitig kreatives Projekt zu entwickeln – und das unter Zeitdruck!</p>\n<p>Am Ende des Projekts nahmen wir an einem Wettbewerb teil, bei dem das beste Projekt prämiert wurde. Das Feedback war sehr positiv, und ich konnte wertvolle Erfahrungen sammeln, die mir bei zukünftigen Projekten sicher weiterhelfen werden.</p>",
            "author": {
                "name": "Christina Poguter"
            },
            "tags": [
                   "Einzelarbeit"
            ],
            "date_published": "2024-11-22T09:36:14+01:00",
            "date_modified": "2024-11-29T09:02:18+01:00"
        }
    ]
}
